Revit 2026 API

# WireSizeSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireSizeSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
WireSizeSetIterator()
```
```fsharp
new : unit -> WireSizeSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

WireSizeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace